### 타이타닉 데이터를 활용한 이진 생존 분류
- Download: https://www.kaggle.com/c/titanic

### 1. Data Description
- total: 1309명
- train.csv: 891x12
- test.csv: 418x11

- Survive: 0=No, 1=Yes
- pclass: 1=1st, 2=2nd, 3=3rd(숫자가 낮을수록 높은 등급)
- SibSP = Sibilings-Spouses
- Parch = Parents-Children

### pandas
- pandas 처럼 2차원 공간에 온 것 = dataframe이라고 함
- feature = 특징(열) = column
- series = 특징 하나에 대한 data
- table = 표
- column = 세로(열)
- row = 가로(행)

### 데이터(CSV,JSON)

- Pandas: 데이터 전처리, 탐색+분석
- Scikit-learn: 머신러닝 (KNN etc..)
- Tensorflow, PyTorch: 딥러닝

### 2. Import Module

In [4]:
import pandas as pd  #데이터 전처리, 탐색, 분석
import numpy as np  #수치해석
import matplotlib.pyplot as plt  #그래프 그려주는 것

### 3. Data Load
- 절대 경로 / 상대경로
    - 웬만해선 상대경로 사용하기(다른 컴퓨터에서도 사용하기 위해)
- .:현재  ..:뒤로가기(폴더 나옴)  /:들어가기(폴더 들어감)

In [9]:
df_train = pd.read_csv('./dataset/train.csv')  #pd.read_csv() = pandas에 들어있는 csv파일을 알려주는 함수
df_test = pd.read_csv('./dataset/test.csv')
df_train.head()  #.head() = 처음부터 5건만 불러옴, .tail() = 끝에서부터 5건

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S